data/sysbench-c2j_shadowing/sdc1thread20
WARNING: --num-threads is deprecated, use --threads instead
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 20
Initializing random number generator from current time


Extra file open flags: 0
128 files, 160MiB each
20GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      2164.33
    writes/s:                     1443.09
    fsyncs/s:                     1443.09

Throughput:
    read, MiB/s:                  33.82
    written, MiB/s:               22.55

General statistics:
    total time:                          60.0123s
    total number of events:              216502

Latency (ms):
         min:                                  0.01
         avg:                                  5.54
         max:                                 34.86
         95th percentile:                     18.95
         sum:                            1198956.15

Threads fairness:
    events (avg/stddev):           10825.1000/515.98
    execution time (avg/stddev):   59.9478/0.00