data/sysbench-c2j_shadowing/sdd1thread40
WARNING: --num-threads is deprecated, use --threads instead
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 40
Initializing random number generator from current time


Extra file open flags: 0
128 files, 160MiB each
20GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      7837.11
    writes/s:                     5225.32
    fsyncs/s:                     5225.32

Throughput:
    read, MiB/s:                  122.45
    written, MiB/s:               81.65

General statistics:
    total time:                          60.0049s
    total number of events:              783855

Latency (ms):
         min:                                  0.00
         avg:                                  3.05
         max:                                 36.59
         95th percentile:                     10.65
         sum:                            2389313.84

Threads fairness:
    events (avg/stddev):           19596.3750/173.34
    execution time (avg/stddev):   59.7328/0.01